### Practice problems
Try the following problems for an enhanced practice of the concepts learned in this lab.

#### 1. Create a new table in the database named Toys with attributes as ID (integer), Variety (variable length string), and Quantity (integer). Make sure the ID is not Null.

In [2]:
%load_ext sql
%sql sqlite:///DA.db

In [3]:
%%sql

Create table Toys (

ID integer not null, 
Variety Varchar(20),
Quantity integer

);

 * sqlite:///DA.db
Done.

[]

#### 2. Add the below-mentioned entries to the table using the INSERT statement.

    ID	Variety	     Quantity
    1	Chew toy	    20
    2	Balls	        50
    3	Bowls	        30
    4	Foldable bed	40

In [4]:
%%sql

INSERT INTO Toys VALUES
        (1, 'Chew toy', 20),
        (2, 'Balls', 50),
        (3, 'Bowls', 30),
        (4, 'Foldable bed', 40);

 * sqlite:///DA.db
4 rows affected.

[]

#### 3. ALTER the length of 'Variety' in the table to 30 characters.

In [5]:
%%sql

ALTER TABLE Toys
MODIFY Variety VARCHAR(30);

 * sqlite:///DA.db
(sqlite3.OperationalError) near "MODIFY": syntax error
[SQL: ALTER TABLE Toys
MODIFY Variety VARCHAR(30);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### 4. TRUNCATE the table 'Toys'

In [6]:
%%sql

TRUNCATE TABLE Toys;

 * sqlite:///DA.db
(sqlite3.OperationalError) near "TRUNCATE": syntax error
[SQL: TRUNCATE TABLE Toys;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### 5. DROP the table 'Toys'

In [7]:
%sql DROP TABLE Toys;

 * sqlite:///DA.db
Done.

[]